Feature:Λογαριασμός


	Background:
	Δεδομένου ότι βρισκόμαστε στην Αρχική σελίδα.

	Scenario: Νέος Λογαριασμός
		Given Δεν έχω λογαριασμό 
		When πατήσω "Δημιουργία Λογαριασμού"
		Then Θα πρέπει να εισάγω Όνομα Χρήστη, Email και Κωδικό Πρόσβασης   
		When Έχει γίνει σωστή εισαγωγή στοιχείων 
		Then Εμφανίζεται το μήνυμα "Επιτυχής νέος Λογαριασμός"
		
	Scenario: Αποτυχία δημιουργίας νέου Λογαριασμού
		Given Δεν έχω λογαριασμό 
		When πατήσω "Δημιουργία Λογαριασμού"
		Then Θα πρέπει να εισάγω Όνομα Χρήστη, Email και Κωδικό Πρόσβασης   
		When Έχει γίνει λανθασμένη εισαγωγή στοιχείων 
		Then Εμφανίζεται το μήνυμα "Αποτυχία δημιουργίας νέου λογαριασμού.Προσπαθείστε ξανά"
		And Θα εμφανίζεται εισαγωγή  Ονόματος Χρήστη, Email και Κωδικού Πρόσβασης 
		
	Scenario: Σύνδεση Χρήστη 
		Given Εχω λογαριασμό 
		When πατήσω "Σύνδεση "
		Then Θα πρέπει να εισάγω Όνομα Χρήστη και Κωδικό Πρόσβασης   
		When Έχει γίνει σωστή εισαγωγή στοιχείων 
		Then Εμφανίζεται το μήνυμα "Καλωσήρθες"
		And Θα πρέπει να εμφανίζεται η αρχική κεντρική σελίδα Χρήστη (Πίνακας) 	

	Scenario: Σύνδεση Χρήστη με Facebook 
		Given Δεν έχω λογαριασμό 
		When πατήσω "Σύνδεση μέσω Facebook"
		Then Θα πρέπει να εμφανιστεί η σελίδα "Σύνδεση με facebook"   
		And Εισάγω στοιχεία εισόδου στο Facebook
		When Έχει γίνει σωστή εισαγωγή στοιχείων 
		Then Εμφανίζεται το μήνυμα "Καλωσήρθες"
		And Θα πρέπει να εμφανίζεται η αρχική κεντρική σελίδα Χρήστη (Πίνακας) 	

	
	Scenario: Αποτυχία Σύνδεση Χρήστη 
		Given Εχω λογαριασμό 
		When πατήσω "Σύνδεση"
		Then Θα πρέπει να εισάγω Όνομα Χρήστη και Κωδικό Πρόσβασης   
		When Έχει γίνει λανθασμένη εισαγωγή στοιχείων 
		Then Εμφανίζεται το μήνυμα "Λάθος Εισαγωγή Στοιχείων"
		And Θα πρέπει να εμφανίζεται η εισαγωγή Ονόματος Χρήστη και Κωδικού Πρόσβασης   		
		
	Scenario: Υπενθύμιση Κωδικού Πρόσβασης
		Given Εχω λογαριασμό 
		When πατήσω "Σύνδεση"
		Then Θα πρέπει να εισάγω Όνομα Χρήστη   
		When Πατήσω το κουμπί "Ξέχασα τον κωδικό μου"  
		Then Στέλνεται νέος κωδικός στο υπάρχων email
		And  Εμφανίζεται το μήνυμα "Ο νέος κωδικος στάλθηκε στο email σας"


	Scenario: Επιλογή βοήθειας
		When πατήσω το κουμπί "Βοήθεια"
		Then Θα πρέπει να εμφανίζεται η σελίδα με σχετικά βοηθητικά άρθρα  
		
		
	Scenario: Πληροφορίες για την εφαρμογή 
		When πατήσω το κουμπί "Πληροφορίες mytop10"
		Then θα εμφανίζεται η σελίδα με τις βασικές πληροφορίες για την εφαρμογή 

	Scenario: Εγχειρίδιο  
		When πατήσω το κουμπί "Δείτε το Βοηθητικο Βίντεο"
		Then θα μεταβαίνει στο Youtube με το Βίντεο με τις οδηγίες χρήσης

	Scenario: Επιλογή άλλης γλώσσας
		When πατήσω το κουμπί "Αλλαγή γλώσσας"
		And Επιλέξω την επιθυμητή γλώσσα 
		Then θα μεταβαίνω στην αντίστοιχη έκδοση της σελίδας







