Feature: Πίνακας

Background:
Δεδομένου ότι ο χρήστης είναι συνδεδεμένος με τον λογαριασμό του.


Scenario: Αυτόματη Αρχική Σελίδα Πίνακα
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου
	Then Εμφανίζονται αυτόματα οι Top Rated Λίστες του τελευταίου 24ώρου	

Scenario: Εμφάνιση Top rated Λίστες  ανά ημέρα
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου
	When πατήσω το κουμπί "Top Rated"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Σήμερα", "Μήνας", "Φέτος"  
	When πατήσω το κουμπί "Σήμερα"
	Then Εμφανίζονται οι Top Rated Λίστες του τελευταίου 24ώρου	

Scenario: Εμφάνιση Top rated Λίστες για τον μήνα
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Top Rated"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Σήμερα", "Μήνας", "Φέτος"  
	When πατήσω το κουμπί "Μήνας"
	Then Εμφανίζονται οι Top Rated Λίστες ολόκληρου του μήνα
	
Scenario: Εμφάνιση Top rated Λίστες για το χρόνο
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Top Rated"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Σήμερα", "Μήνας", "Φέτος"  
	When πατήσω το κουμπί "Φέτος"
	Then Εμφανίζονται οι Top Rated Λίστες ολόκληρου του χρόνου
	
	
Scenario: Εμφάνιση Λίστες Φίλων
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Friends List"
	Then Εμφανίζονται οι Λίστες των φίλων μου σε χρολογική σειρά  	
	
Scenario: Εμφάνιση των Νέων Λιστών
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "New"
	Then Εμφανίζονται οι Λίστες που έχουν δημιουργηθεί πρόσφατα σε χρολογική σειρά  	

Scenario: Εμφάνιση Αγαπημέων Λιστών 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί " My Favorites"
	Then Εμφανίζονται οι Λίστες που έχω κάνει κατηγοροποιήσει ως "Favorite" σε χρολογική σειρά  	
	
Scenario: Εμφάνιση Λίστών ανά Λίστες (Βιβλία) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια"  
	When πατήσω το κουμπί "Βιβλία"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Βιβλία" σε κατάταξη με βάση την γενική βαθμολογία
	
Scenario: Εμφάνιση Λίστών ανά Λίστες (Ταινίες) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια"  
	When πατήσω το κουμπί "Ταινίες"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Ταινίες" σε κατάταξη με βάση την γενική βαθμολογία
	
Scenario: Εμφάνιση Λίστών ανά Λίστες (Τραγούδια) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια"  
	When πατήσω το κουμπί "Τραγούδια"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Τραγούδια" σε κατάταξη με βάση την γενική βαθμολογία	
	
	
	
	
	
	
	
	
	
	
