Feature: Προφίλ 


	Background:
	Δεδομένου ότι ο χρήστης είναι συνδεδεμένος.

	Scenario: Ανέβασμα Φωτογραφίας Προφίλ 
    Given Βρίσκομαι στη σελίδα επεξεργασία προφίλ
		And Δεν έχω φωτογραφία στο προφίλ 
		When πατήσω "Προσθήκη Φωτογραφίας Προφίλ"
		Then Θα πρέπει να επίλεξω μια φωτογραφία από αρχείο  
		And πατήσω το κουμπί "Οκ"
		Then Εμφανίζεται το μήνυμα "Η φωτογραφία ανέβηκε επιτυχώς"
		
	Scenario: Αλλαγή τρέχουσας φωτογραφίας Προφίλ 
		Given Βρίσκομαι στη σελίδα επεξεργασία προφίλ
    And Έχω φωτογραφία στο προφίλ
		When πατήσω "Αλλαγή τρέχουσας φωτογραφίας Προφίλ"
		Then Θα πρέπει να επίλεξω μια φωτογραφία από αρχείο  
		And πατήσω το κουμπί "Οκ"
		Then Εμφανίζεται το μήνυμα "Η φωτογραφία  προφίλ σας άλλαξε επιτυχώς"
    
	Scenario: Αλλαγή Ονόματος Χρήστη πρώτη φορά 
		Given Βρίσκομαι στη σελίδα επεξεργασία προφίλ
    And και δεν έχω αλλάξει το Όνομα Χρήστη προηγούμενη φορά
		When πατήσω "Αλλαγή Ονόματος Χρήστη"
		Then εμαφανίζεται πεδίο αλλαγής ονόματος χρήστη  
		And πληκτρολογήσω νέο Όνομα Χρήστη  
    And πατήσω το κουμπί "Save"
		Then Εμφανίζεται το μήνυμα "Το Όνομα Χρήστη σας άλλαξε επιτυχώς"

	Scenario: Αλλαγή Ονόματος Χρήστη πρώτη φορά 
		Given Βρίσκομαι στη σελίδα επεξεργασία προφίλ
    And και δεν έχω αλλάξει το Όνομα Χρήστη προηγούμενη φορά
		When πατήσω "Αλλαγή Ονόματος Χρήστη"
		Then εμαφανίζεται πεδίο αλλαγής ονόματος χρήστη  
		And πληκτρολογήσω νέο Όνομα Χρήστη  
    And πατήσω το κουμπί "Save"
		Then Εμφανίζεται το μήνυμα "Το Όνομα Χρήστη σας άλλαξε επιτυχώς"
    
    
    
    
    
    
    
    
    
    




