Feature: Αναζήτηση

	Background:
	Δεδομένου ότι βρισκόμαστε στον Πίνακα.

	Scenario: Αναζήτηση φίλων 
		When πατήσω "Αναζήτηση"
		Then Θα εμφανίζεται πεδίο αναζήτησης μαζί με επιλογές "Άτομα", "Λίστες", "Περιεχόμενο"
		And επιλέγω "Άτομα"
		And εισάγω κείμενο με πιθανό Όνομα Χρήστη 
		When το κείμενο ταυτίζεται με Όνομα χρήστη 
		Then εμφανίζεται η σελίδα προφίλ του
		

	Scenario: Αποτυχία αναζήτησης φίλων 
		When πατήσω "Αναζήτηση"
		Then Θα εμφανίζεται πεδίο αναζήτησης μαζί με επιλογές "Άτομα", "Λίστες", "Περιεχόμενο"
		And επιλέγω "Άτομα"
		And εισάγω κείμενο με πιθανό Όνομα Χρήστη 
		When το κείμενο δεν ταυτίζεται με Όνομα χρήστη 
		Then εμφανίζεται "ο Χρήστης δεν βρέθηκε"

