Feature: Πίνακας

Background:
Δεδομένου ότι ο χρήστης είναι συνδεδεμένος με τον λογαριασμό του.


Scenario: Αυτόματη Αρχική Σελίδα Πίνακα
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου
	Then Εμφανίζονται αυτόματα οι Top Rated Λίστες του τελευταίου 24ώρου	

Scenario: Εμφάνιση Top rated Λίστες  ανά ημέρα
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου
	When πατήσω το κουμπί "Top Rated"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Σήμερα", "Μήνας", "Φέτος"  
	When πατήσω το κουμπί "Σήμερα"
	Then Εμφανίζονται οι Top Rated Λίστες του τελευταίου 24ώρου	

Scenario: Εμφάνιση Top rated Λίστες για τον μήνα
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Top Rated"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Σήμερα", "Μήνας", "Φέτος"  
	When πατήσω το κουμπί "Μήνας"
	Then Εμφανίζονται οι Top Rated Λίστες ολόκληρου του μήνα
	
Scenario: Εμφάνιση Top rated Λίστες για το χρόνο
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Top Rated"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Σήμερα", "Μήνας", "Φέτος"  
	When πατήσω το κουμπί "Φέτος"
	Then Εμφανίζονται οι Top Rated Λίστες ολόκληρου του χρόνου
	
	
Scenario: Εμφάνιση Λίστες Φίλων
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Friends List"
	Then Εμφανίζονται οι Λίστες των φίλων μου σε χρολογική σειρά  	
	
Scenario: Εμφάνιση των Νέων Λιστών
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "New"
	Then Εμφανίζονται οι Λίστες που έχουν δημιουργηθεί πρόσφατα σε χρολογική σειρά  	

Scenario: Εμφάνιση Αγαπημέων Λιστών 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί " My Favorites"
	Then Εμφανίζονται οι Λίστες που έχω κάνει κατηγοροποιήσει ως "Favorite" σε χρολογική σειρά  	
	
Scenario: Εμφάνιση Λίστών ανά κατηγορία (Βιβλία) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια"  
	When πατήσω το κουμπί "Βιβλία"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Βιβλία" σε κατάταξη με βάση την γενική βαθμολογία
	
Scenario: Εμφάνιση Λίστών ανά κατηγορία (Ταινίες) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια"  
	When πατήσω το κουμπί "Ταινίες"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Ταινίες" σε κατάταξη με βάση την γενική βαθμολογία
	
Scenario: Εμφάνιση Λίστών ανά κατηγορία (Τραγούδια) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια"  
	When πατήσω το κουμπί "Τραγούδια"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Τραγούδια" σε κατάταξη με βάση την γενική βαθμολογία	
	
	
Scenario: Εμφάνιση Λίστών ανά κατηγορία (Σειρές) 
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Categories"
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Βιβλία", "Ταινίες", "Τραγούδια", "Σειρές" 
	When πατήσω το κουμπί "Σειρές"
	Then Εμφανίζονται οι Λίστες της κατηγορίας "Σειρές" σε κατάταξη με βάση την γενική βαθμολογία	
	
Scenario: Εμφάνιση σελίδας ρυθμίσεων
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί με το username
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Επεξεργασία προφίλ", "Ρυθμίσεις", "Αποσύνδεση"
	When πατήσω το κουμπί "Ρυθμίσεις"
	Then Εμφανίζεται η σελίδα των ρυθμίσεων
	
Scenario: Εμφάνιση σελίδας επεξεργασίας προφίλ
    	Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί με το username
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Επεξεργασία προφίλ", "Ρυθμίσεις", "Αποσύνδεση"
	When πατήσω το κουμπί "Επεξεργασία προφίλ"
	Then Εμφανίζεται η σελίδα της επεξεργασίας προφίλ
	
	
Scenario: Επιτυχής Αποσύνδεση Λογαριασμού
 Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί με το username
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Επεξεργασία προφίλ", "Ρυθμίσεις", "Αποσύνδεση"
	When πατήσω το κουμπί "Αποσύνδεση"
	Then Εμφανίζεται πλαίσιο με τις επιλογές "Επιβεβαίωση" και "Άκυρο"
	When πατήσω το κουμπί "Επιβεβαίωση"
	Then Ο Χρήστης αποσυνδεέται και εμφανίζει την αρχική  γενική Οθόνη
	
	
Scenario: Ανεπιτυχής Αποσύνδεση Λογαριασμού
Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί με το username
	Then Εμφανίζεται το αναπτυσομένο παράθυρο με τις επιλογές "Επεξεργασία προφίλ", "Ρυθμίσεις", "Αποσύνδεση"
    When πατήσω το κουμπί "Αποσύνδεση"
	Then Εμφανίζεται πλαίσιο με τις επιλογές "Επιβεβαίωση" και "Άκυρο"
	When πατήσω το κουμπί "Άκυρο"
	Then Ο Χρήστης παραμένει στην κατάσταση που βρίσκονταν πριν 
	


Scenario: Εμφάνιση πρόσφατου ιστορικού
Given Βρίσκομαι στην αρχική σελίδα του Πίνακα μου	
	When πατήσω το κουμπί "Ιστορικό Λιστών"
	Then Εμφανίζεται η σελίδα προβολής του ιστορικού λιστών
    And επιλέγω ποιας κατηγορίας λίστες θέλω να εμφανιστούν
	Then Εμφανίζονται οι λίστες της αντίστοιχης κατηγορίας


Scenario: Επιτυχής διαγραφή ιστορικού
Given Βρίσκομαι στη σελίδα του ιστορικού μου	
	When πατήσω το κουμπί "Διαγραφή ιστορικού"
	Then Εμφανίζεται παράθυρο με ερώτηση "Είστε σίγουρος ότι θέλετε να διαγράψετε το ιστορικό σας?" 
    When πατήσω το κουμπί "Συνέχεια"
	Then Εμφανίζεται πλαίσιο με μήνυμα "Το ιστορικό διαγράφηκε επιτυχώς"
	
	
Scenario: ανεπιτυχής διαγραφή ιστορικού
Given Βρίσκομαι στη σελίδα του ιστορικού μου	
	When πατήσω το κουμπί "Διαγραφή ιστορικού"
	Then Εμφανίζεται παράθυρο με ερώτηση "Είστε σίγουρος ότι θέλετε να διαγράψετε το ιστορικό σας?"
    When πατήσω το κουμπί "Άκυρο"
	Then Επιστρέφω στη σελίδα του ιστορικού μου
	
