
Feature: Notifications

Background:
Δεδομένου ότι ο χρήστης βρίσκεται στην κεντρική σελίδα του πίνακά του


Scenario: Ειδοποίηση σχολιασμού μιας λίστας μου από άλλο χρήστη.
          Given Ότι βρίσκομαι στη σελίδα "πίνακας"
          When Κάποιος χρήστης σχολιάσει κάποια από τις λίστες μου
          Then θα αναδυθεί μικρό πλαίσιο που εμφανίζει το μήνυμα "ο <χρήστης> σχολίασε την λίστα <όνομα λίστας>"


Scenario: Ειδοποίηση βαθμολόγησης μιας λίστας μου από άλλο χρήστη.
          Given Ότι βρίσκομαι στον κεντρικό πίνακα της εφαρμογής
          When Κάποιος χρήστης βαθμολογήσει κάποια από τις λίστες μου
          Then θα αναδυθεί μικρό πλαίσιο που εμφανίζει το μήνυμα "ο <χρήστης> βαθμολόγησε την λίστα <όνομα λίστας> με <1-5> αστέρια"


Scenario: Ειδοποίηση αναφοράς μιας λίστας μου από άλλο χρήστη.
          Given Ότι βρίσκομαι στον κεντρικό πίνακα της εφαρμογής
          When Κάποιος χρήστης κάνει report κάποια από τις λίστες μου
          Then θα αναδυθεί μικρό πλαίσιο που θα εμφανίζει το μήνυμα "ο <χρήστης> έκανε report την λίστα <όνομα λίστας>"


Scenario: Ειδοποίηση ότι κάποιος χρήστης με ακολουθεί.
          Given Ότι βρίσκομαι στον κεντρικό πίνακα της εφαρμογής
          When Κάποιος χρήστης με ακολουθήσει
          Then θα αναδυθεί μικρό πλαίσιο που θα εμφανίζει το μήνυμα "ο <χρήστης> σας ακολουθεί"


Scenario: Ειδοποίηση ότι κάποιος χρήστης έβαλε μια λίστα μου στα "Αγαπημένα" του.
          Given Ότι βρίσκομαι στον κεντρικό πίνακα της εφαρμογής
          When Κάποιος  χρήστης προσθέσει μια λίστα μου στα "Αγαπημένα" του
          Then θα αναδυθεί μικρό πλαίσιο που θα εμφανίζει το μήνυμα "ο <χρήστης> πρόσθεσε την <λίστα> στα Αγαπημένα του"


Scenario: Ειδοποίηση ότι κάποιος χρήστης που ακολουθώ δημοσίευσε μια νέα λίστα.
          Given Ότι βρίσκομαι στον κεντρικό πίνακα της εφαρμογής
          When Κάποιος χρήστης που ακολουθώ δημοσιεύσει μια νέα λίστα
          Then θα αναδυθεί μικρό πλαίσιο που εμφανίζει το μήνυμα "ο <χρήστης> δημοσίευσε την λίστα <όνομα λίστας>"



