Feature: Σελίδα λίστας χρήστη

Background:
Δεδομένου ότι ο χρήστης βρίσκεται στην σελίδα λιστών κάποιου άλλου χρήστη


Scenario: Βαθμολόγηση λίστας
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Βαθμολόγηση"
          Then θα εμφανιστεί η μπάρα βαθμολόγησης της λίστας απο 1 εώς 5 "αστέρια"
          When δώσω τη βαθμολογία που επιθυμώ
          Then θα εμφανιστεί το μήνυμα " Η λίστα βαθμολογήθηκε επιτυχώς"
          And η λίστα ταινιών θα βαθμολογηθεί


Scenario:Επιτυχής σχολιασμός λίστας
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Σχολιασμός λίστας"
          Then θα εμφανιστεί το πλαίσιο εισαγωγής σχολίου
          When εισάγω το σχόλιο 
          And πατήσω το κουμπι "Υποβολή"
          Then θα εμφανιστεί το μήνυμα "Είστε σίγουρος για αυτό το σχόλιο; "
          When πατήσω το κουμπί "ΟΚ"
          Then το σχολιο δημοσιεύεται


Scenario:Ανεπιτυχής σχολιασμός λίστας
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Σχολιασμός λίστας"
          Then θα εμφανιστεί το πλαίσιο εισαγωγής σχολίου
          When εισάγω το σχόλιο 
          And πατήσω το κουμπι "Υποβολή"
          Then θα εμφανιστεί το μήνυμα "Είστε σίγουρος για αυτό το σχόλιο; "
          When πατήσω το κουμπί "Άκυρο"
          Then το σχολιο δεν δημοσιεύεται


Scenario:Κατέβασμα λίστας σε αρχείο μορφής pdf
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Κατέβασμα λίστας"
          Then η λίστα θα αποθηκευεί στον υπολογιστή σε μορφή αρχείου pdf


Scenario: Αναφορά περιεχόμενου λίστας
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Αναφορά περιεχομένου λίστας"
          Then η αναφορά θα σταλεί επιτυχώς


Scenario:Επιτυχής εισαγωγή λίστας στα "My favorites"		
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Favorite"
          Then θα εμφανιστεί το μήνυμα "Είστε σίγουρος ότι επιθυμείτε να εισάγετε την συγκεκριμένη λίστα στα αγαπημένα;"
          When πατήσω το κουμπί "OK"
          Then η λίστα θα προστεθεί στο "My favorites"


Scenario:Ανεπιτυχής εισαγωγή λίστας στα "My favorites"
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Favorite"
          Then θα εμφανιστεί το μήνυμα "Είστε σίγουρος ότι επιθυμείτε να εισάγετε την συγκεκριμένη λίστα στα αγαπημένα;"
          When πατήσω το κουμπι "Άκυρο"
          Then η λίστα δεν θα προστεθεί στα "My favorites"


Scenario: Προβολή μέσου όρου βαθμολογιών λίστας
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί " Μ.Ο. βαθμολογιών"
          Then θα εμφανίζεται ο μέσος όρος βαθμολογιών για τη συγκεκριμένη λίστα



Scenario: Προβολή σχολίων λίστας
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί " Εμφάνιση όλων των σχολίων"
          Then εμφανίζονται όλα τα σχόλια που έχουν πραγματοποιηθεί για τη συγκεκριμένη λίστα.



Scenario: Επιτυχές Follow σε κάποιον χρήστη
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Follow"
          Then εμφανίζεται το μήνυμα "Είστε σίγουρος ότι θέλετε να ακολουθήσετε τον <Χρήστη>?"
          When πατήσω "Οκ"
          Then επιστρέφω στη σελίδα λίστας του χρήστη
          And εμφανίζεται μήνυμα "Ο <Χρήστης> προστέθηκε στην λίστα των χρηστών που ακολουθείτε"



Scenario: Ανεπιτυχές Follow σε κάποιον χρήστη
          Given Βρίσκομαι σε σελίδα λίστας κάποιου χρήστη
          When πατήσω το κουμπί "Follow"
          Then εμφανίζεται το μήνυμα "Είστε σίγουρος ότι θέλετε να ακολουθήσετε τον <Χρήστη>?"
          When πατήσω "Άκυρο"
          Then επιστρέφω στη σελίδα λίστας του χρήστη

